In [105]:
working_data={
    "name_first":["shiva","honey",'kannama',"subhash"],
    "name_last":["venkatesan","rajkumar","rajkumar","venkatesan"],
    "mail_ID":["shiva@hotmail.com","honey@hotmail.com","kannama@hotmail.com","bose@hotmail.com"]
}

In [106]:
import pandas as pd

In [107]:
df=pd.DataFrame(working_data)

In [108]:
df

  name_first   name_last              mail_ID
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [109]:
df.columns

Index(['name_first', 'name_last', 'mail_ID'], dtype='object')

In [110]:
df.columns=['first_name','last_name','Mail_id']

In [111]:
df

  first_name   last_name              Mail_id
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [112]:
df.columns['first_name']=['first_name'.upper() for 'first_name' in df.columns]

SyntaxError: cannot assign to literal (1529974405.py, line 1)

In [113]:
df

  first_name   last_name              Mail_id
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [114]:
df.columns =[x.upper() for x in df.columns]

In [115]:
df

  FIRST_NAME   LAST_NAME              MAIL_ID
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [116]:
df.columns =df.columns.str.replace('FIRST_NAME','original_name')

In [117]:
df

  original_name   LAST_NAME              MAIL_ID
0         shiva  venkatesan    shiva@hotmail.com
1         honey    rajkumar    honey@hotmail.com
2       kannama    rajkumar  kannama@hotmail.com
3       subhash  venkatesan     bose@hotmail.com

In [118]:
df.columns =df.columns.str.replace('_',' ')

In [119]:
df

  original name   LAST NAME              MAIL ID
0         shiva  venkatesan    shiva@hotmail.com
1         honey    rajkumar    honey@hotmail.com
2       kannama    rajkumar  kannama@hotmail.com
3       subhash  venkatesan     bose@hotmail.com

In [120]:
df.columns =df.columns.str.upper()

In [121]:
df

  ORIGINAL NAME   LAST NAME              MAIL ID
0         shiva  venkatesan    shiva@hotmail.com
1         honey    rajkumar    honey@hotmail.com
2       kannama    rajkumar  kannama@hotmail.com
3       subhash  venkatesan     bose@hotmail.com

In [122]:
df.columns =df.columns.str.replace(' ','_')

In [123]:
df

  ORIGINAL_NAME   LAST_NAME              MAIL_ID
0         shiva  venkatesan    shiva@hotmail.com
1         honey    rajkumar    honey@hotmail.com
2       kannama    rajkumar  kannama@hotmail.com
3       subhash  venkatesan     bose@hotmail.com

In [124]:
df.rename(columns={'ORIGINAL_NAME':'first_name','LAST_NAME':'second_name','MAIL_ID':'mail__id'},inplace=True)

In [125]:
df

  first_name second_name             mail__id
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [126]:
df

  first_name second_name             mail__id
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [133]:
df.loc[2,['second_name','mail__id']]=['rk','adirk@hotmail.com']

In [134]:
df

  first_name second_name           mail__id
0      shiva  venkatesan  shiva@hotmail.com
1      honey    rajkumar  honey@hotmail.com
2     adiraa          rk  adirk@hotmail.com
3    subhash  venkatesan   bose@hotmail.com

In [135]:
df.loc[2]=['adiraa','rkj','adiraarkj@hotmail.com']

In [136]:
df

  first_name second_name               mail__id
0      shiva  venkatesan      shiva@hotmail.com
1      honey    rajkumar      honey@hotmail.com
2     adiraa         rkj  adiraarkj@hotmail.com
3    subhash  venkatesan       bose@hotmail.com

In [141]:
filt=( df ['mail__id']=='bose@hotmail.com')
df[filt]['second_name']='abc'

C:\Users\SIVA\AppData\Local\Temp\ipykernel_16504\2491011517.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['second_name']='abc'

In [143]:
filt=( df ['mail__id']=='bose@hotmail.com')
df.loc[filt,'second_name']='abc'

In [144]:
df

  first_name second_name               mail__id
0      shiva  venkatesan      shiva@hotmail.com
1      honey    rajkumar      honey@hotmail.com
2     adiraa         rkj  adiraarkj@hotmail.com
3    subhash         abc       bose@hotmail.com

In [149]:
df['mail__id']=df['mail__id'].str.upper()

In [150]:
df

  first_name second_name               mail__id
0      shiva  venkatesan      SHIVA@HOTMAIL.COM
1      honey    rajkumar      HONEY@HOTMAIL.COM
2     adiraa         rkj  ADIRAARKJ@HOTMAIL.COM
3    subhash         abc       BOSE@HOTMAIL.COM